CssAuthGuide/note/chapter4.org
* 第4章-值和单位
** 数字
   CSS中有两类数字:
   - 整数
   - 实数
   
** 函数式RGB颜色
   #+begin_src css
     rgb(100%, 100%, 100%)
     rgb(0%, 0%, 0%)
     rgb(255, 255,255)
     rgb(0, 0,0)
   #+end_src

** 长度单位
   长度单位可以划归为两类
   - 绝对长度单位
   - 相对长度单位
  
*** 绝对长度单位
    有5种绝对长度单位, Web设计中很少使用
    - 英寸(in)
    - 厘米(cm)
    - 毫米(mm)
    - 点(pt)
    - 派卡(pc), 1派卡等于12点
*** 相对长度单位
    有3种相对长度单位
    - em(em-height)
    - ex(x-height)
    - px(像素)
    
    在CSS中, 一个 ~em~ 定义为一种给定字体的 ~font-size~ 的值. 
    - 如果一个元素的 ~font-size~ 为14像素, 那么对于该元素, 1em就等于14像素.
      
    一般情况 ~1ex~ 等于 ~0.5em~.

** URL
   使用 ~@import~ 导入外部样式表, URL一般格式为
   #+begin_src css
     url(protocol://server/pathname)
   #+end_src

   如果URL指向一个相对位置, 一般格式为
   #+begin_src css
     url(pathname)
   #+end_src

** inherit
   CSS2.1中有一个关键字是所有属性共有的, 这就是 ~inherit~. ~inherit~ 使一个属性的值与其父元素的值相同.
   - 大多情况不需要指定继承, 默认使用继承.
   

** CSS2单位
   CSS2还包含另外几个单位, 所有这些单位都与声音样式表有关.
   - 角度值: 度(deg), 梯度(grad)和弧度(rad)
   - 时间值(毫秒和秒)
   - 频率值(赫兹和兆赫)
